



#________________________________________________________________________________________________________________________________

# 1. Даны два действительных числа а и Ь. Получить их сумму, разность и произведение.
number_a = int(input("Введите число 'а': "))
number_b = int(input("Введите число 'Ь': "))

result_1 = number_a + number_b  # получаем сумму
result_2 = number_a - number_b  # получаем разность
result_3 = number_a * number_b  # получаем произведение

print(f"Сумма чисел {number_a} и {number_b} равна '{result_1}'")
print(f"Разность чисел {number_a} и {number_b} равна '{result_2}'")
print(f"Произведение чисел {number_a} и {number_b} равна '{result_3}'")

#________________________________________________________________________________________________________________________________
