











// ________________________________________________________________________________________________________________________________

// 1. Даны два действительных числа а и Ь. Получить их сумму, разность и произведение.

Console.Write("Введите число 'a': "); // запрашиваем число
int number_a = Convert.ToInt32(Console.ReadLine()); // получаем от пользователя число


Console.Write("Введите число 'b': "); // запрашиваем число
int number_b = Convert.ToInt32(Console.ReadLine()); // получаем от пользователя число

int result_1 = number_a + number_b;  // получаем сумму
int result_2 = number_a - number_b;  // получаем разность
int result_3 = number_a * number_b;  // получаем произведение

Console.WriteLine($"Сумма чисел {number_a} и {number_b} равна '{result_1}'");
Console.WriteLine($"Разность чисел {number_a} и {number_b} равна '{result_2}'");
Console.WriteLine($"Произведение чисел {number_a} и {number_b} равна '{result_3}'");


// ________________________________________________________________________________________________________________________________